In [238]:
import pandas as pd
import numpy as np

In [5]:
s = pd.Series(range(100,110),  dtype=float)    #needs iterable data

In [6]:
s.dtype

dtype('float64')

In [7]:
s

0    100.0
1    101.0
2    102.0
3    103.0
4    104.0
5    105.0
6    106.0
7    107.0
8    108.0
9    109.0
dtype: float64

In [50]:
pd.Series({"potter":"the one who lives", "wick":"the one  you send to kill the fuckin boogeyman"})

potter                                 the one who lives
wick      the one  you send to kill the fuckin boogeyman
dtype: object

In [51]:
pd.Series(["King in the North","A lone Wolf"], index=["John Snow","Arya Stark"])

John Snow     King in the North
Arya Stark          A lone Wolf
dtype: object

In [52]:
pd.DataFrame?

Init signature: pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
Docstring:
Two-dimensional size-mutable, potentially heterogeneous tabular data
structure with labeled axes (rows and columns). Arithmetic operations
align on both row and column labels. Can be thought of as a dict-like
container for Series objects. The primary pandas data structure.

Parameters
----------
data : numpy ndarray (structured or homogeneous), dict, or DataFrame
    Dict can contain Series, arrays, constants, or list-like objects

    .. versionchanged :: 0.23.0
       If data is a dict, argument order is maintained for Python 3.6
       and later.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided
columns : Index or array-like
    Column labels to use for resulting frame. Will default to
    RangeIndex (0, 1, 2, ..., n) if no column labels are provided
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer
copy : boolean, default False
    Copy data from inputs. Only affects DataFrame / 2d ndarray input

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.random.randint(low=0, high=10, size=(5, 5)),
...                    columns=['a', 'b', 'c', 'd', 'e'])
>>> df2
    a   b   c   d   e
0   2   8   8   3   4
1   4   2   9   0   9
2   1   0   7   8   0
3   5   1   7   1   3
4   6   0   2   4   2

See also
--------
DataFrame.from_records : constructor from tuples, also record arrays
DataFrame.from_dict : from dicts of Series, arrays, or dicts
DataFrame.from_items : from sequence of (key, value) pairs
pandas.read_csv, pandas.read_table, pandas.read_clipboard
File:           c:\users\navpreet kaur\anaconda3\lib\site-packages\pandas\core\frame.py
Type:           type

In [28]:
n = pd.DataFrame(np.random.randint(10,20,(5,5)))

In [29]:
n

    0   1   2   3   4
0  16  18  12  12  12
1  15  14  18  12  18
2  15  12  13  14  17
3  18  16  19  17  16
4  14  11  16  15  11

In [44]:
ind = list("ABCDE")

In [45]:
col = list("ABCDE")

In [46]:
ind,col

(['A', 'B', 'C', 'D', 'E'], ['A', 'B', 'C', 'D', 'E'])

In [49]:
pd.DataFrame(n, index=ind, columns=col)

    A   B   C   D   E
A NaN NaN NaN NaN NaN
B NaN NaN NaN NaN NaN
C NaN NaN NaN NaN NaN
D NaN NaN NaN NaN NaN
E NaN NaN NaN NaN NaN

In [53]:
names = ["Nav","Smile","Muskan"]
ages = [21,16,30]

In [54]:
d = {"names":names, "ages":ages}

In [55]:
d

{'names': ['Nav', 'Smile', 'Muskan'], 'ages': [21, 16, 30]}

In [62]:
d1 = [{"name":"prince","age":21},{"name":"manav","age":21},{"name":"amar","age":20},{"name":"manjot","age":22}]

In [63]:
exes = pd.DataFrame(d1)

In [97]:
exes.to_csv("exes.csv", index = False)   #comma seperated values

In [142]:
pd.read_csv("exes.csv")   #csv file is a text file

   age     name  place
0   21   prince  Delhi
1   21    manav  Delhi
2   20     amar  Delhi
3   22   manjot  Delhi
4   30  mandeep  Delhi
5   24    joban  Delhi

In [143]:
exes.to_html("exes.html")

In [144]:
exes.to_csv("exes.csv", index = False)

In [145]:
exes.name

0    prince
1     manav
2      amar
3    manjot
Name: name, dtype: object

In [146]:
exes.columns

Index(['age', 'name', 'place'], dtype='object')

In [147]:
exes.index

RangeIndex(start=0, stop=4, step=1)

In [148]:
exes["name"]  #when you have special symbols or spaces in the col name

0    prince
1     manav
2      amar
3    manjot
Name: name, dtype: object

In [149]:
exes["place"] = ["Delhi"] * 4

In [139]:
exes[exes.age > 20]

   age    name  place
0   21  prince  Delhi
1   21   manav  Delhi
3   22  manjot  Delhi

In [140]:
exes.age>20

0     True
1     True
2    False
3     True
Name: age, dtype: bool

In [141]:
exes

   age    name  place
0   21  prince  Delhi
1   21   manav  Delhi
2   20    amar  Delhi
3   22  manjot  Delhi

In [151]:
exes.iloc[2:,1:]

     name  place
2    amar  Delhi
3  manjot  Delhi

In [152]:
exes.iloc[::-1,1:]

     name  place
3  manjot  Delhi
2    amar  Delhi
1   manav  Delhi
0  prince  Delhi

In [153]:
exes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
age      4 non-null int64
name     4 non-null object
place    4 non-null object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [155]:
ak47 = exes.describe()   #consider the int row

In [156]:
type(ak47)

pandas.core.frame.DataFrame

In [160]:
exes.sort_index(ascending=False)

   age    name  place
3   22  manjot  Delhi
2   20    amar  Delhi
1   21   manav  Delhi
0   21  prince  Delhi

In [161]:
exes.sort_values("age")

   age    name  place
2   20    amar  Delhi
0   21  prince  Delhi
1   21   manav  Delhi
3   22  manjot  Delhi

In [162]:
exes.dtypes

age       int64
name     object
place    object
dtype: object

In [164]:
exes.head(2)

   age    name  place
0   21  prince  Delhi
1   21   manav  Delhi

In [166]:
exes.tail(3)

   age    name  place
1   21   manav  Delhi
2   20    amar  Delhi
3   22  manjot  Delhi

In [168]:
exes.T

            0      1      2       3
age        21     21     20      22
name   prince  manav   amar  manjot
place   Delhi  Delhi  Delhi   Delhi

In [170]:
new = pd.date_range('20200202', periods=5)

In [171]:
new

DatetimeIndex(['2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05',
               '2020-02-06'],
              dtype='datetime64[ns]', freq='D')

In [176]:
df = pd.DataFrame({'A' : range(4),
                   'B' : pd.date_range('20200202', periods=4),
                   'C' : np.array(["I'm Shrewd"] * 4, dtype='str'),
                   'D' : pd.Categorical(["Viper","Python","Sidewinder","Cobra"])
                
})

In [177]:
df

   A          B           C           D
0  0 2020-02-02  I'm Shrewd       Viper
1  1 2020-02-03  I'm Shrewd      Python
2  2 2020-02-04  I'm Shrewd  Sidewinder
3  3 2020-02-05  I'm Shrewd       Cobra

In [178]:
df.dtypes

A             int64
B    datetime64[ns]
C            object
D          category
dtype: object

In [179]:
df.describe()

              A
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [180]:
df.T

,0,1,2,3
A,0,1,2,3
B,2020-02-02 00:00:00,2020-02-03 00:00:00,2020-02-04 00:00:00,2020-02-05 00:00:00
C,I'm Shrewd,I'm Shrewd,I'm Shrewd,I'm Shrewd
D,Viper,Python,Sidewinder,Cobra

In [181]:
df.sort_values(by='D')

   A          B           C           D
3  3 2020-02-05  I'm Shrewd       Cobra
1  1 2020-02-03  I'm Shrewd      Python
2  2 2020-02-04  I'm Shrewd  Sidewinder
0  0 2020-02-02  I'm Shrewd       Viper

In [182]:
df['D']

0         Viper
1        Python
2    Sidewinder
3         Cobra
Name: D, dtype: category
Categories (4, object): [Cobra, Python, Sidewinder, Viper]

In [184]:
df.loc[:, ['A','B']] #select using label

   A          B
0  0 2020-02-02
1  1 2020-02-03
2  2 2020-02-04
3  3 2020-02-05

In [185]:
df.iloc[1:2, 0:2]   #select using position

   A          B
1  1 2020-02-03

In [188]:
s1 = pd.Series(["Python","Conda","Spyder","Viper"], index=pd.date_range('20200202', periods=4))

In [189]:
s1

2020-02-02    Python
2020-02-03     Conda
2020-02-04    Spyder
2020-02-05     Viper
Freq: D, dtype: object

In [191]:
df.at[new[0],'A'] = 0

In [192]:
df

                       A          B           C           D
0                    0.0 2020-02-02  I'm Shrewd       Viper
1                    1.0 2020-02-03  I'm Shrewd      Python
2                    2.0 2020-02-04  I'm Shrewd  Sidewinder
3                    3.0 2020-02-05  I'm Shrewd       Cobra
2020-02-02 00:00:00  0.0        NaT         NaN         NaN

In [193]:
new

DatetimeIndex(['2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05',
               '2020-02-06'],
              dtype='datetime64[ns]', freq='D')

In [194]:
df.loc[:,'A'] = np.array([4]*len(df))

In [195]:
df

                     A          B           C           D
0                    4 2020-02-02  I'm Shrewd       Viper
1                    4 2020-02-03  I'm Shrewd      Python
2                    4 2020-02-04  I'm Shrewd  Sidewinder
3                    4 2020-02-05  I'm Shrewd       Cobra
2020-02-02 00:00:00  4        NaT         NaN         NaN

In [199]:
df

                     A          B           C           D
0                    4 2020-02-02  I'm Shrewd       Viper
1                    4 2020-02-03  I'm Shrewd      Python
2                    4 2020-02-04  I'm Shrewd  Sidewinder
3                    4 2020-02-05  I'm Shrewd       Cobra
2020-02-02 00:00:00  4        NaT         NaN         NaN

In [220]:
df1 = df.reindex(index=range(4), columns=list(df.columns) + ["E"])

In [221]:
df1

   A          B           C           D   E
0  4 2020-02-02  I'm Shrewd       Viper NaN
1  4 2020-02-03  I'm Shrewd      Python NaN
2  4 2020-02-04  I'm Shrewd  Sidewinder NaN
3  4 2020-02-05  I'm Shrewd       Cobra NaN

In [222]:
df1.iloc[:2,-1] = "sherlocked"

In [223]:
df1

   A          B           C           D           E
0  4 2020-02-02  I'm Shrewd       Viper  sherlocked
1  4 2020-02-03  I'm Shrewd      Python  sherlocked
2  4 2020-02-04  I'm Shrewd  Sidewinder         NaN
3  4 2020-02-05  I'm Shrewd       Cobra         NaN

In [224]:
pd.isna(df1)  #is NAN valuse?

       A      B      C      D      E
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False   True
3  False  False  False  False   True

In [226]:
df2 = df1.copy()
df2

   A          B           C           D           E
0  4 2020-02-02  I'm Shrewd       Viper  sherlocked
1  4 2020-02-03  I'm Shrewd      Python  sherlocked
2  4 2020-02-04  I'm Shrewd  Sidewinder         NaN
3  4 2020-02-05  I'm Shrewd       Cobra         NaN

In [227]:
df2.dropna(how="any")    #Dropping the NAN values

   A          B           C       D           E
0  4 2020-02-02  I'm Shrewd   Viper  sherlocked
1  4 2020-02-03  I'm Shrewd  Python  sherlocked

In [231]:
a = pd.read_csv("exes.csv")

In [232]:
a

   age    name  place
0   21  prince  Delhi
1   21   manav  Delhi
2   20    amar  Delhi
3   22  manjot  Delhi
4   25  manjot  Delhi

In [233]:
a

   age    name  place
0   21  prince  Delhi
1   21   manav  Delhi
2   20    amar  Delhi
3   22  manjot  Delhi
4   25  manjot  Delhi